serviceWorking.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:ms="http://mulesoft.org/tshirt-service"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  name="TshirtService"
                  targetNamespace="http://mulesoft.org/tshirt-service">

    <!-- [types and messages remain unchanged] -->
    <!-- ... keep your types and messages exactly as before ... -->

    <!-- portType remains unchanged -->
    <!-- ... -->

    <wsdl:binding name="TshirtServiceSoapBinding" type="ms:TshirtServicePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />

        <wsdl:operation name="OrderTshirt">
            <soap:operation soapAction="http://mulesoft.org/tshirt-service/order-tshirt" />
            <wsdl:input>
                <soap:body use="literal" namespace="http://mulesoft.org/tshirt-service" />
                <soap:header use="literal" part="header" message="ms:AuthenticationHeader" />
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" namespace="http://mulesoft.org/tshirt-service" />
                <soap:header use="literal" part="header" message="ms:APIUsageInformation" />
            </wsdl:output>
            <wsdl:fault name="TshirtFault">
                <soap:fault name="TshirtFault" use="literal" namespace="http://mulesoft.org/tshirt-service" />
            </wsdl:fault>
        </wsdl:operation>

        <wsdl:operation name="ListInventory">
            <soap:operation soapAction="http://mulesoft.org/tshirt-service/list-inventory" />
            <wsdl:input>
                <soap:body use="literal" namespace="http://mulesoft.org/tshirt-service" />
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" namespace="http://mulesoft.org/tshirt-service" />
            </wsdl:output>
            <wsdl:fault name="TshirtFault">
                <soap:fault name="TshirtFault" use="literal" namespace="http://mulesoft.org/tshirt-service" />
            </wsdl:fault>
        </wsdl:operation>

        <wsdl:operation name="TrackOrder">
            <soap:operation soapAction="http://mulesoft.org/tshirt-service/track-order" />
            <wsdl:input>
                <soap:body use="literal" namespace="http://mulesoft.org/tshirt-service" />
                <soap:header use="literal" part="header" message="ms:AuthenticationHeader" />
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" namespace="http://mulesoft.org/tshirt-service" />
                <soap:header use="literal" part="header" message="ms:APIUsageInformation" />
            </wsdl:output>
            <wsdl:fault name="TshirtFault">
                <soap:fault name="TshirtFault" use="literal" namespace="http://mulesoft.org/tshirt-service" />
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="TshirtService">
        <wsdl:documentation />
        <wsdl:port name="TshirtServicePort" binding="ms:TshirtServiceSoapBinding">
            <soap:address location="http://localhost:8088/tshirtService" />
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
