src/main/resources/examples/Input_Transform_ListInventory.json

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tsh="http://mulesoft.org/tshirt-service">
   <soapenv:Header/>
   <soapenv:Body>
      <tsh:ListInventory>
      </tsh:ListInventory>
   </soapenv:Body>
</soapenv:Envelope>